In [2]:
import urllib.request
import json
import pandas as pd
import bs4

In [14]:
korea = pd.read_csv('./source/전국 모든 업종.csv',sep=',',encoding='utf8')
del korea['Unnamed: 0']
korea.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,...,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,20173815,황진이,NaN,Q,음식,Q09,유흥주점,Q09A10,룸살롱/단란주점,I56211,...,4213010100102030001000001,NaN,강원도 원주시 중앙로 61,220904.0,26429.0,NaN,1,NaN,127.952252,37.347773

# 햄버거 상호코드 Q07을 알아내기 위해 처음부터 시작함
- 상호코드를 알아낸 이후에는 바로 고유 ID로

In [15]:
korea[['상호명','상권업종중분류코드']][korea.상호명.str.find('버거') >= 0]

                상호명 상권업종중분류코드
12          버거킹오션월드       Q07
9860          송탄햄버거       Q07
15499        버거225℃       Q07
15517    케이오십오수제햄버거       Q07
15879          버거타운       Q07
...             ...       ...
2557105     프랭크수제버거       Q06
2558024       랭고스버거       Q07
2558025       브룩스버거       Q07
2558166         버거샵       Q07
2559257       앵그리버거       Q07

[2576 rows x 2 columns]

In [78]:
burger = pd.read_csv('./source/고유 ID 버거.csv',sep=',',encoding='utf8')
del burger['Unnamed: 0']
burger['상호명'] = burger['상호명'].str.lower()
burger.head()

       상호명  지점명                도로명주소          경도         위도  ID
0  버거킹오션월드  NaN  강원도 홍천군 서면 한치골길 262  127.687273  37.652324  홍천
1      로데오  NaN   강원도 강릉시 경강로 2090-1  128.895743  37.754245  강릉
2   왕눈이도넛츠  NaN   강원도 영월군 영월읍 삼옥재길 2  128.476234  37.209981  영월
3  씨지브이원주2  NaN     강원도 원주시 서원대로 171  127.930798  37.344816  원주
4   베스킨라벤스  NaN       강원도 삼척시 진주로 35  129.163718  37.443797  삼척

# 1. 버거킹

In [79]:
king_kr1 = burger[burger['상호명'].str.find('버거킹') >= 0]
king_kr1.shape

(451, 6)

In [80]:
king_en1 = burger[burger['상호명'].str.find('burger king') >= 0]
king_en1.shape

(0, 6)

In [81]:
king = pd.concat([king_kr1,king_en1])
king_count = pd.pivot_table(data = king,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
king_count.rename(columns={
    '상호명':'개수'
},inplace=True)
king_count.reset_index(inplace=True)
king_count

        ID  개수
0       강릉   1
1       거제   4
2       경산   4
3       경주   1
4    고양 덕양   3
..     ...  ..
131  포항 북구   2
132     하남   2
133     홍성   1
134     홍천   4
135     화성   5

[136 rows x 2 columns]

# 2. 맥도날드

In [87]:
mac_kr1 = burger[burger['상호명'].str.find('맥도날드') >= 0]
mac_kr1.shape

(655, 6)

In [88]:
mac_kr2 = burger[burger['상호명'].str.find('맥도널드') >= 0]
mac_kr2.shape

(3, 6)

In [89]:
mac_en1 = burger[burger['상호명'].str.find('Mcdonald') >= 0]
mac_en1.shape

(0, 6)

In [91]:
mac = pd.concat([mac_kr1,mac_kr2,mac_en1])
mac_count = pd.pivot_table(data = mac,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
mac_count.rename(columns={
    '상호명':'개수'
},inplace=True)
mac_count.reset_index(inplace=True)
mac_count

         ID  개수
0        강릉   1
1        거제   3
2        경주   4
3     고양 덕양   8
4    고양 일산동   8
..      ...  ..
149   포항 남구   3
150   포항 북구   6
151      하남   1
152      홍성   2
153      화성   6

[154 rows x 2 columns]

# 3. 롯데리아

In [95]:
lot_kr1 = burger[burger['상호명'].str.find('롯데리아') >= 0]
lot_kr1.shape

(1123, 6)

In [96]:
lot_en1 = burger[burger['상호명'].str.find('lotte') >= 0]
lot_en1.shape

(0, 6)

In [97]:
lot_count = pd.pivot_table(data = lot_kr1,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
lot_count.rename(columns={
    '상호명':'개수'
},inplace=True)
lot_count.reset_index(inplace=True)
lot_count

     ID  개수
0    가평   4
1    강릉   5
2    강진   1
3    거제   4
4    거창   2
..   ..  ..
213  홍성   1
214  홍천   3
215  화성  18
216  화천   2
217  횡성   1

[218 rows x 2 columns]

# 4. KFC

In [120]:
kfc_kr1 = burger[burger['상호명'].str.find('케이에프') >= 0]
kfc_kr1.shape

(44, 6)

In [106]:
kfc_en1 = burger[burger['상호명'].str.find('kfc') >= 0]
kfc_en1.shape

(173, 6)

In [121]:
kfc = pd.concat([kfc_kr1,kfc_en1])
kfc_count = pd.pivot_table(data = kfc,
                              index = 'ID',
                              values = '상호명',
                              aggfunc = 'count')
kfc_count.rename(columns={
    '상호명':'개수'
},inplace=True)
kfc_count.reset_index(inplace=True)
kfc_count

        ID  개수
0       경산   2
1       경주   1
2    고양 덕양   2
3   고양 일산동   3
4   고양 일산서   2
..     ...  ..
86   포항 남구   1
87   포항 북구   2
88      하남   2
89      화성   1
90      횡성   1

[91 rows x 2 columns]

# 5. 맘스터치